Revit 2027 API
SpatialElementGeometryCalculator.CanCalculateGeometry Method
 This indicates whether the input spatial element is a valid one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanCalculateGeometry(
	SpatialElement spatialElement
)
Public Shared Function CanCalculateGeometry (
	spatialElement As SpatialElement
) As Boolean
public:
static bool CanCalculateGeometry(
	SpatialElement^ spatialElement
)
static member CanCalculateGeometry :
        spatialElement : SpatialElement -> bool
Parameters
spatialElement SpatialElement
 The spatial element to be checked if its geometry can be calculated.
Return Value
Boolean
 It will return false if the room/space is not enclosed in 2d or has no location, or the height is too small.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace